[
  {
    "file": "experiments/infinityPressure.js",
    "name": "Infinity Pressure",
    "description": "The inspiration comes from the artwork named Infinity Pressure by Joshua Davis Studios. The scratch idea is to draw circles to create an pipe that goes down and up in a pattern, with size changes using noise. When working with the color, I used both noise to generate a shading difference in the gray-scale, but used a math.random() value to generate different shades of blue. To get the interactive moving changes in the art, a random function is also used to either increase or decrease the opacity of each ellipse."
  },
  {
    "file": "experiments/infinityPressureV2.js",
    "name": "Infinity Pressure V2",
    "description": "This is a second verision of the artwork Infinity Pressure, and is therefore inspired by the same bases as the original. However, in this verision there is some changes in the design and I decided to use color in a different way. In this verision the color appears depending on the position of your mouse, making the artwork more interative for the user. However, the color that appears is generated similar to the color as in the original verision."
  } ,
  {
    "file": "experiments/haskell.js",
    "name": "Haskell Ben Kovach",
    "description": "A re-creation of artwork Haskell - Ben Kovach, which is following a clear grid created with for loops. It involves a randomness within a limit of the position of each squares corner. Apart from the shape, also the color is random selected from a selection of a few alternatives using Math.random(). There is also a chance of no square at all at every position, which also uses math.random()."
   } ,
  {
    "file": "experiments/haskellV2.js",
    "name": "Haskell Ben Kovach V2",
    "description": "Using the same foundation and colors as the first verision. However, this artwork is based on circles instead of squares, and instead of different position of the corners the size is changing. The size changes also uses Noise which is new for V2. This one also has removed the noLoop() function making the random pattern being drawn continuesly and looks like there is drawn new patterns all the time."
   }
]
